app/controllers/adresses_controller.rb

  def index
    if params.key?("university_id")
      @adresses = Adress.all.where(addressable_id: params[:university_id])
    else
      @adresses = Adress.all.where(addressable_id: params[:student_id])
---
SELECT `adresses`.* FROM `adresses` WHERE `adresses`.`addressable_id` IS NULL
SELECT `adresses`.* FROM `adresses` WHERE `adresses`.`addressable_id` = 8