app/controllers/groups_controller.rb

INSERT INTO `groups` (`number`, `created_at`, `updated_at`, `university_id`, `session_id`) VALUES (753501, '2019-10-31 19:53:55.247789', '2019-10-31 19:53:55.247789', 8, 6)
---
  def create
    @group = Group.new(group_params)
    if @group.save

UPDATE `groups` SET `groups`.`number` = 753502, `groups`.`updated_at` = '2019-10-31 20:05:22.704526' WHERE `groups`.`id` = 7
---
  def update
    @group = group_find
    if @group.update(group_params)

DELETE FROM `groups` WHERE `groups`.`id` = 6
---
  def destroy
    @group = group_find
    @group.destroy

SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 7 LIMIT 1
---
  def group_find
    @group = Group.find(params[:id])