app/controllers/lecturers_controller.rb

  def index
    @lecturers = Lecturer.all
---
SELECT `lecturers`.* FROM `lecturers`

  def lecturer_find
    @lecturer = Lecturer.find(params[:id])
---
SELECT `lecturers`.* FROM `lecturers` WHERE `lecturers`.`id` = 2 LIMIT 1