app/controllers/student_cards_controller.rb

  def card_find
    @card = StudentCard.find(params[:id])
---
SELECT `student_cards`.* FROM `student_cards` WHERE `student_cards`.`id` = 15 LIMIT 1