app/controllers/students_controller.rb

SELECT `students`.* FROM `students` WHERE `students`.`group_id` = 5
---
  def index
    @students = Student.all.where(group_id: params[:group_id])

INSERT INTO `students` (`last_name`, `first_name`, `patronymic`, `created_at`, `updated_at`, `group_id`, `headman_id`) VALUES ('Beketova', 'Tatsiana', 'Alexandrovna', '2019-10-31 21:06:13.110794', '2019-10-31 21:06:13.110794', 7, 15)
---
  def create
    @student = Student.new(student_params)
    if @student.save

DELETE FROM `students` WHERE `students`.`id` = 23
---
  def destroy
    @student = student_find
    @student.destroy

SELECT AVG(`subject_marks`.`mark`) FROM `subject_marks` WHERE `subject_marks`.`student_id` = 17
SELECT `subject_marks`.* FROM `subject_marks` WHERE `subject_marks`.`student_id` = 17 LIMIT 1
---
  def average_mark
    @average = SubjectMark.all.where(student_id: params[:id]).average(:mark)

SELECT `students`.* FROM `students` WHERE `students`.`id` = 1 LIMIT 1
---
  def student_find
    @student = Student.find(params[:id])