app/controllers/subject_marks_controller.rb

  def index
    @marks = SubjectMark.all.where(student_id: params[:student_id])
---
SELECT `subject_marks`.* FROM `subject_marks` WHERE `subject_marks`.`student_id` = 15

  def create
    @mark = SubjectMark.new(mark_params)
    if @mark.save
---
INSERT INTO `subject_marks` (`student_id`, `subject_id`, `mark`, `created_at`, `updated_at`) VALUES (17, 17, 7, '2019-11-01 10:27:55.665524', '2019-11-01 10:27:55.665524')