app/controllers/subjects_controller.rb

INSERT INTO `subjects` (`name`, `created_at`, `updated_at`) VALUES ('QWERt', '2019-11-01 20:50:26.173154', '2019-11-01 20:50:26.173154')
---
  def create
    @subject = Subject.new(subject_params)
    if @subject.save

DELETE FROM `subjects` WHERE `subjects`.`id` = 19
---
  def destroy
    subject_find.destroy

SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 19 LIMIT 1
---
  def subject_find
    @subject = Subject.find(params[:id])