app/controllers/universities_controller.rb

SELECT `universities`.* FROM `universities`
---
  def index
    @universities = University.all